Revit 2027 API
ParameterTypeId.RoomDesignLightingLoadParam Property
 "Specified Lighting Load"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RoomDesignLightingLoadParam { get; }
Public Shared ReadOnly Property RoomDesignLightingLoadParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RoomDesignLightingLoadParam {
	ForgeTypeId^ get ();
}
static member RoomDesignLightingLoadParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace